In [1]:
import pandas as pd

In [4]:
df = pd.DataFrame({'col01':[1,2,3],'col02':[4,5,6],'col03':[7,8,9]}
                   ,index=['idx01','idx02','idx03'])
df

       col01  col02  col03
idx01      1      4      7
idx02      2      5      8
idx03      3      6      9

In [5]:
df.columns

Index(['col01', 'col02', 'col03'], dtype='object')

In [15]:
#df.index=['idx01','idx02','idx04']
df.rename(index={'idx03':'idx04'})
df

       col01  col02  col03
idx01      1      4      7
idx02      2      5      8
idx04      3      6      9

In [17]:
df['col01']

idx01    1
idx02    2
idx04    3
Name: col01, dtype: int64

In [18]:
df.iloc[:,0]

idx01    1
idx02    2
idx04    3
Name: col01, dtype: int64

In [19]:
df.loc[:,'col01':'col02']

       col01  col02
idx01      1      4
idx02      2      5
idx04      3      6

In [20]:
df.dtypes

col01    int64
col02    int64
col03    int64
dtype: object